# Pandas

In [1]:
import numpy as np
import pandas as pd
pd.__version__

'1.3.3'

# Object creation

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,5), index=dates, columns=list("ABDCX"))
df

                   A         B         D         C         X
2013-01-01  0.265321  0.245713 -0.775044 -0.499731  0.387253
2013-01-02  1.203653 -0.892446 -2.243681  0.491511  0.103652
2013-01-03 -0.344146 -0.021151 -0.272869 -0.289217  1.518457
2013-01-04  1.586598  1.929543 -1.940718 -1.351495  0.171966
2013-01-05 -0.257775 -0.051017  0.993570 -1.282187  0.198135
2013-01-06 -1.747506  0.670198 -1.061827 -0.533415 -0.873928

In [5]:
np.random.randn(6,4)

array([[ 1.62853983,  0.48113197, -1.05451476,  1.30621437],
       [-0.92165958,  0.78325006, -1.78778332,  1.47903981],
       [-1.17745582, -0.16492567,  1.72850025, -0.45785708],
       [-2.19393571,  0.76590926, -0.84706065,  0.66370365],
       [-0.61907472, -0.7055981 ,  0.02924245, -0.25905992],
       [-1.7983918 ,  0.23957645,  0.95569017, -1.67200423]])

In [6]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)),dtype="float32"),
        "D": np.array([3]*4,dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo"
    }
)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [7]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# Viewing data

In [8]:
df.head()

                   A         B         D         C         X
2013-01-01  0.265321  0.245713 -0.775044 -0.499731  0.387253
2013-01-02  1.203653 -0.892446 -2.243681  0.491511  0.103652
2013-01-03 -0.344146 -0.021151 -0.272869 -0.289217  1.518457
2013-01-04  1.586598  1.929543 -1.940718 -1.351495  0.171966
2013-01-05 -0.257775 -0.051017  0.993570 -1.282187  0.198135

In [9]:
df.tail(4)

                   A         B         D         C         X
2013-01-03 -0.344146 -0.021151 -0.272869 -0.289217  1.518457
2013-01-04  1.586598  1.929543 -1.940718 -1.351495  0.171966
2013-01-05 -0.257775 -0.051017  0.993570 -1.282187  0.198135
2013-01-06 -1.747506  0.670198 -1.061827 -0.533415 -0.873928

In [10]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df.columns

Index(['A', 'B', 'D', 'C', 'X'], dtype='object')

In [12]:
df.to_numpy()

array([[ 0.2653212 ,  0.24571345, -0.77504426, -0.49973078,  0.3872528 ],
       [ 1.2036534 , -0.89244587, -2.24368122,  0.49151119,  0.10365193],
       [-0.34414568, -0.02115117, -0.27286888, -0.28921714,  1.51845665],
       [ 1.58659821,  1.92954312, -1.94071836, -1.35149493,  0.17196611],
       [-0.25777464, -0.05101694,  0.99357046, -1.28218724,  0.19813458],
       [-1.74750621,  0.6701985 , -1.0618275 , -0.53341515, -0.87392802]])

In [13]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [14]:
df.describe()

              A         B         D         C         X
count  6.000000  6.000000  6.000000  6.000000  6.000000
mean   0.117691  0.313474 -0.883428 -0.577422  0.250922
std    1.199335  0.942613  1.175383  0.682574  0.764359
min   -1.747506 -0.892446 -2.243681 -1.351495 -0.873928
25%   -0.322553 -0.043551 -1.720996 -1.094994  0.120730
50%    0.003773  0.112281 -0.918436 -0.516573  0.185050
75%    0.969070  0.564077 -0.398413 -0.341846  0.339973
max    1.586598  1.929543  0.993570  0.491511  1.518457

In [15]:
df

                   A         B         D         C         X
2013-01-01  0.265321  0.245713 -0.775044 -0.499731  0.387253
2013-01-02  1.203653 -0.892446 -2.243681  0.491511  0.103652
2013-01-03 -0.344146 -0.021151 -0.272869 -0.289217  1.518457
2013-01-04  1.586598  1.929543 -1.940718 -1.351495  0.171966
2013-01-05 -0.257775 -0.051017  0.993570 -1.282187  0.198135
2013-01-06 -1.747506  0.670198 -1.061827 -0.533415 -0.873928

In [16]:
df.sort_index(axis=1, ascending=False)

                   X         D         C         B         A
2013-01-01  0.387253 -0.775044 -0.499731  0.245713  0.265321
2013-01-02  0.103652 -2.243681  0.491511 -0.892446  1.203653
2013-01-03  1.518457 -0.272869 -0.289217 -0.021151 -0.344146
2013-01-04  0.171966 -1.940718 -1.351495  1.929543  1.586598
2013-01-05  0.198135  0.993570 -1.282187 -0.051017 -0.257775
2013-01-06 -0.873928 -1.061827 -0.533415  0.670198 -1.747506

In [17]:
df.sort_values(by="X", ascending=False)

                   A         B         D         C         X
2013-01-03 -0.344146 -0.021151 -0.272869 -0.289217  1.518457
2013-01-01  0.265321  0.245713 -0.775044 -0.499731  0.387253
2013-01-05 -0.257775 -0.051017  0.993570 -1.282187  0.198135
2013-01-04  1.586598  1.929543 -1.940718 -1.351495  0.171966
2013-01-02  1.203653 -0.892446 -2.243681  0.491511  0.103652
2013-01-06 -1.747506  0.670198 -1.061827 -0.533415 -0.873928

# Getting

In [18]:
df.D

2013-01-01   -0.775044
2013-01-02   -2.243681
2013-01-03   -0.272869
2013-01-04   -1.940718
2013-01-05    0.993570
2013-01-06   -1.061827
Freq: D, Name: D, dtype: float64

In [19]:
df[0:2]

                   A         B         D         C         X
2013-01-01  0.265321  0.245713 -0.775044 -0.499731  0.387253
2013-01-02  1.203653 -0.892446 -2.243681  0.491511  0.103652

In [20]:
df["2013-01-05":"2013-01-06"]

                   A         B         D         C         X
2013-01-05 -0.257775 -0.051017  0.993570 -1.282187  0.198135
2013-01-06 -1.747506  0.670198 -1.061827 -0.533415 -0.873928

# Selection by label

In [21]:
df.loc[dates[0]]

A    0.265321
B    0.245713
D   -0.775044
C   -0.499731
X    0.387253
Name: 2013-01-01 00:00:00, dtype: float64

In [22]:
df

                   A         B         D         C         X
2013-01-01  0.265321  0.245713 -0.775044 -0.499731  0.387253
2013-01-02  1.203653 -0.892446 -2.243681  0.491511  0.103652
2013-01-03 -0.344146 -0.021151 -0.272869 -0.289217  1.518457
2013-01-04  1.586598  1.929543 -1.940718 -1.351495  0.171966
2013-01-05 -0.257775 -0.051017  0.993570 -1.282187  0.198135
2013-01-06 -1.747506  0.670198 -1.061827 -0.533415 -0.873928

In [23]:
df.loc[:,["D","X"]]

                   D         X
2013-01-01 -0.775044  0.387253
2013-01-02 -2.243681  0.103652
2013-01-03 -0.272869  1.518457
2013-01-04 -1.940718  0.171966
2013-01-05  0.993570  0.198135
2013-01-06 -1.061827 -0.873928

In [24]:
df.loc["2013-01-02":"2013-01-03", ["X", "C","D"]]

                   X         C         D
2013-01-02  0.103652  0.491511 -2.243681
2013-01-03  1.518457 -0.289217 -0.272869

In [25]:
df.loc["20130103", "C"]

-0.28921713711668606

In [26]:
df.at[dates[2],"X"]

1.518456649679037

In [27]:
df.iloc[1]

A    1.203653
B   -0.892446
D   -2.243681
C    0.491511
X    0.103652
Name: 2013-01-02 00:00:00, dtype: float64

In [28]:
df.iloc[3:5, 2:]

                   D         C         X
2013-01-04 -1.940718 -1.351495  0.171966
2013-01-05  0.993570 -1.282187  0.198135

In [29]:
df.iloc[[1,3,4],[2,0]]

                   D         A
2013-01-02 -2.243681  1.203653
2013-01-04 -1.940718  1.586598
2013-01-05  0.993570 -0.257775

In [30]:
df.iloc[0:3,:]

                   A         B         D         C         X
2013-01-01  0.265321  0.245713 -0.775044 -0.499731  0.387253
2013-01-02  1.203653 -0.892446 -2.243681  0.491511  0.103652
2013-01-03 -0.344146 -0.021151 -0.272869 -0.289217  1.518457

In [31]:
df.iloc[:,0:3]

                   A         B         D
2013-01-01  0.265321  0.245713 -0.775044
2013-01-02  1.203653 -0.892446 -2.243681
2013-01-03 -0.344146 -0.021151 -0.272869
2013-01-04  1.586598  1.929543 -1.940718
2013-01-05 -0.257775 -0.051017  0.993570
2013-01-06 -1.747506  0.670198 -1.061827

In [32]:
df.iloc[1,1]

-0.892445866423123

In [33]:
df.iat[0,0]

0.26532119607295823

# Boolean indexing

In [34]:
df[df["A"]>0]

                   A         B         D         C         X
2013-01-01  0.265321  0.245713 -0.775044 -0.499731  0.387253
2013-01-02  1.203653 -0.892446 -2.243681  0.491511  0.103652
2013-01-04  1.586598  1.929543 -1.940718 -1.351495  0.171966

In [35]:
df[df<0]

                   A         B         D         C         X
2013-01-01       NaN       NaN -0.775044 -0.499731       NaN
2013-01-02       NaN -0.892446 -2.243681       NaN       NaN
2013-01-03 -0.344146 -0.021151 -0.272869 -0.289217       NaN
2013-01-04       NaN       NaN -1.940718 -1.351495       NaN
2013-01-05 -0.257775 -0.051017       NaN -1.282187       NaN
2013-01-06 -1.747506       NaN -1.061827 -0.533415 -0.873928

## Using two column values to select data

In [36]:
df[(df["A"]>0) & (df["D"]<0)]

                   A         B         D         C         X
2013-01-01  0.265321  0.245713 -0.775044 -0.499731  0.387253
2013-01-02  1.203653 -0.892446 -2.243681  0.491511  0.103652
2013-01-04  1.586598  1.929543 -1.940718 -1.351495  0.171966

In [37]:
df2 = df.copy()
df2["E"] = ["one", "one", "two", "three", "four", "three"]
df2

                   A         B         D         C         X      E
2013-01-01  0.265321  0.245713 -0.775044 -0.499731  0.387253    one
2013-01-02  1.203653 -0.892446 -2.243681  0.491511  0.103652    one
2013-01-03 -0.344146 -0.021151 -0.272869 -0.289217  1.518457    two
2013-01-04  1.586598  1.929543 -1.940718 -1.351495  0.171966  three
2013-01-05 -0.257775 -0.051017  0.993570 -1.282187  0.198135   four
2013-01-06 -1.747506  0.670198 -1.061827 -0.533415 -0.873928  three

In [38]:
df2[df2["E"].isin(["one", "three"])]

                   A         B         D         C         X      E
2013-01-01  0.265321  0.245713 -0.775044 -0.499731  0.387253    one
2013-01-02  1.203653 -0.892446 -2.243681  0.491511  0.103652    one
2013-01-04  1.586598  1.929543 -1.940718 -1.351495  0.171966  three
2013-01-06 -1.747506  0.670198 -1.061827 -0.533415 -0.873928  three

# Setting

In [39]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index = pd.date_range("20130102", periods=6))
s1
df["F"] = s1

In [40]:
df.at[dates[0], "B"] = 0

In [41]:
df.iat[0,1] = 0
df

                   A         B         D         C         X    F
2013-01-01  0.265321  0.000000 -0.775044 -0.499731  0.387253  NaN
2013-01-02  1.203653 -0.892446 -2.243681  0.491511  0.103652  1.0
2013-01-03 -0.344146 -0.021151 -0.272869 -0.289217  1.518457  2.0
2013-01-04  1.586598  1.929543 -1.940718 -1.351495  0.171966  3.0
2013-01-05 -0.257775 -0.051017  0.993570 -1.282187  0.198135  4.0
2013-01-06 -1.747506  0.670198 -1.061827 -0.533415 -0.873928  5.0

In [42]:
df.loc[:, "D"]

2013-01-01   -0.775044
2013-01-02   -2.243681
2013-01-03   -0.272869
2013-01-04   -1.940718
2013-01-05    0.993570
2013-01-06   -1.061827
Freq: D, Name: D, dtype: float64

In [43]:
df.loc[:, "D"] = np.array([5] * len(df))
df

                   A         B  D         C         X    F
2013-01-01  0.265321  0.000000  5 -0.499731  0.387253  NaN
2013-01-02  1.203653 -0.892446  5  0.491511  0.103652  1.0
2013-01-03 -0.344146 -0.021151  5 -0.289217  1.518457  2.0
2013-01-04  1.586598  1.929543  5 -1.351495  0.171966  3.0
2013-01-05 -0.257775 -0.051017  5 -1.282187  0.198135  4.0
2013-01-06 -1.747506  0.670198  5 -0.533415 -0.873928  5.0

In [44]:
df2 = df.copy()
df2[df2>0] = -df2
df2

                   A         B  D         C         X    F
2013-01-01 -0.265321  0.000000 -5 -0.499731 -0.387253  NaN
2013-01-02 -1.203653 -0.892446 -5 -0.491511 -0.103652 -1.0
2013-01-03 -0.344146 -0.021151 -5 -0.289217 -1.518457 -2.0
2013-01-04 -1.586598 -1.929543 -5 -1.351495 -0.171966 -3.0
2013-01-05 -0.257775 -0.051017 -5 -1.282187 -0.198135 -4.0
2013-01-06 -1.747506 -0.670198 -5 -0.533415 -0.873928 -5.0

# Missing data

In [45]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])
df1.loc[dates[0] : dates[1], "E"] = 1
df1

                   A         B  D         C         X    F    E
2013-01-01  0.265321  0.000000  5 -0.499731  0.387253  NaN  1.0
2013-01-02  1.203653 -0.892446  5  0.491511  0.103652  1.0  1.0
2013-01-03 -0.344146 -0.021151  5 -0.289217  1.518457  2.0  NaN
2013-01-04  1.586598  1.929543  5 -1.351495  0.171966  3.0  NaN

In [46]:
df1.dropna(how="any")

                   A         B  D         C         X    F    E
2013-01-02  1.203653 -0.892446  5  0.491511  0.103652  1.0  1.0

In [47]:
df1.fillna(value=5)

                   A         B  D         C         X    F    E
2013-01-01  0.265321  0.000000  5 -0.499731  0.387253  5.0  1.0
2013-01-02  1.203653 -0.892446  5  0.491511  0.103652  1.0  1.0
2013-01-03 -0.344146 -0.021151  5 -0.289217  1.518457  2.0  5.0
2013-01-04  1.586598  1.929543  5 -1.351495  0.171966  3.0  5.0

In [48]:
pd.isna(df1)

                A      B      D      C      X      F      E
2013-01-01  False  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False  False
2013-01-03  False  False  False  False  False  False   True
2013-01-04  False  False  False  False  False  False   True

# Operations

In [49]:
df.mean()

A    0.117691
B    0.272521
D    5.000000
C   -0.577422
X    0.250922
F    3.000000
dtype: float64

In [50]:
df.mean(1)

2013-01-01    1.030569
2013-01-02    1.151062
2013-01-03    1.310657
2013-01-04    1.722769
2013-01-05    1.267859
2013-01-06    1.252558
Freq: D, dtype: float64

In [51]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [52]:
df.sub(s, axis="index")

                   A         B    D         C         X    F
2013-01-01       NaN       NaN  NaN       NaN       NaN  NaN
2013-01-02       NaN       NaN  NaN       NaN       NaN  NaN
2013-01-03 -1.344146 -1.021151  4.0 -1.289217  0.518457  1.0
2013-01-04 -1.413402 -1.070457  2.0 -4.351495 -2.828034  0.0
2013-01-05 -5.257775 -5.051017  0.0 -6.282187 -4.801865 -1.0
2013-01-06       NaN       NaN  NaN       NaN       NaN  NaN

# Apply

In [53]:
df.apply(np.cumsum)

                   A         B   D         C         X     F
2013-01-01  0.265321  0.000000   5 -0.499731  0.387253   NaN
2013-01-02  1.468975 -0.892446  10 -0.008220  0.490905   1.0
2013-01-03  1.124829 -0.913597  15 -0.297437  2.009361   3.0
2013-01-04  2.711427  1.015946  20 -1.648932  2.181327   6.0
2013-01-05  2.453652  0.964929  25 -2.931119  2.379462  10.0
2013-01-06  0.706146  1.635128  30 -3.464534  1.505534  15.0

In [54]:
df

                   A         B  D         C         X    F
2013-01-01  0.265321  0.000000  5 -0.499731  0.387253  NaN
2013-01-02  1.203653 -0.892446  5  0.491511  0.103652  1.0
2013-01-03 -0.344146 -0.021151  5 -0.289217  1.518457  2.0
2013-01-04  1.586598  1.929543  5 -1.351495  0.171966  3.0
2013-01-05 -0.257775 -0.051017  5 -1.282187  0.198135  4.0
2013-01-06 -1.747506  0.670198  5 -0.533415 -0.873928  5.0

In [55]:
s = pd.Series(np.random.randint(0,7, size=10))
s.value_counts()

6    3
4    3
3    2
2    1
0    1
dtype: int64

# String methods

In [56]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

# Merge

## Concat

In [57]:
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0  0.569312 -0.729561 -0.836612 -0.169597
1  0.180091  0.979207 -0.177327  0.101670
2 -1.354564  1.198020  0.670693 -0.152561
3  0.231883  0.418861  0.370951 -0.981536
4 -0.321811  0.098093 -0.275798  0.737821
5 -1.454677 -1.809174 -1.858984  0.783878
6  1.640367 -0.253869  1.605309  0.552069
7  2.208161  1.639213 -0.941821 -1.614780
8  0.275858  1.089253  0.048886 -0.247895
9  1.732947  1.385147 -0.749237  0.810376

In [58]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0  0.569312 -0.729561 -0.836612 -0.169597
 1  0.180091  0.979207 -0.177327  0.101670
 2 -1.354564  1.198020  0.670693 -0.152561,
           0         1         2         3
 3  0.231883  0.418861  0.370951 -0.981536
 4 -0.321811  0.098093 -0.275798  0.737821
 5 -1.454677 -1.809174 -1.858984  0.783878
 6  1.640367 -0.253869  1.605309  0.552069,
           0         1         2         3
 7  2.208161  1.639213 -0.941821 -1.614780
 8  0.275858  1.089253  0.048886 -0.247895
 9  1.732947  1.385147 -0.749237  0.810376]

In [59]:
pd.concat(pieces)

          0         1         2         3
0  0.569312 -0.729561 -0.836612 -0.169597
1  0.180091  0.979207 -0.177327  0.101670
2 -1.354564  1.198020  0.670693 -0.152561
3  0.231883  0.418861  0.370951 -0.981536
4 -0.321811  0.098093 -0.275798  0.737821
5 -1.454677 -1.809174 -1.858984  0.783878
6  1.640367 -0.253869  1.605309  0.552069
7  2.208161  1.639213 -0.941821 -1.614780
8  0.275858  1.089253  0.048886 -0.247895
9  1.732947  1.385147 -0.749237  0.810376

# Join

In [62]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [65]:
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1,2]})
right = pd.DataFrame({"key": ["foo", "bar"], "rval": [4, 5]})
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  bar     2     5

# Grouping

In [66]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),  
    }
)
df

     A      B         C         D
0  foo    one  1.728325 -0.044019
1  bar    one -1.342349  1.017229
2  foo    two  1.665577  0.089194
3  bar  three  1.448692  0.666150
4  foo    two  0.468555 -0.981746
5  bar    two  1.289090 -1.136613
6  foo    one -0.474342  0.072326
7  foo  three -0.373665  1.274391

In [67]:
df.groupby("A").sum()

            C         D
A
bar  1.395433  0.546766
foo  3.014450  0.410145

In [70]:
df.groupby(["A", "B"]).sum()

                  C         D
A   B
bar one   -1.342349  1.017229
    three  1.448692  0.666150
    two    1.289090 -1.136613
foo one    1.253983  0.028306
    three -0.373665  1.274391
    two    2.134132 -0.892552